	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. PARC-SEC.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT CLIENTE2 ASSIGN TO DISK.
	   DATA DIVISION.
	   FILE SECTION.
	   FD CLIENTE2.
      *
	   01 REG-CLI.
	       03 ID-CLIENTE PIC 9(03).
		   03 NOM-CLI    PIC X(30).
		   03 CLA-TAR    PIC 9.
		   03 NOM-TAR    PIC X(20).
		   03 ANUA       PIC 9(05)V99.
		   03 FEC-ING    PIC 9(08).
	   
	   WORKING-STORAGE SECTION.
	   77 WKS-FIN            PIC 9.
	   77 WKS-DESC           PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO.
	       PERFORM 1000-INICIO.
		   PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
		   PERFORM 3000-FIN.
		   STOP RUN.
		   
	   1000-INICIO.
      *    CREAR ARCHIVO.
      *    PRIMERA VEZ.	  
      *     OPEN OUTPUT CLIENTE2.
      *    SI YA EXISTE:
           OPEN EXTEND CLIENTE2.	  
	  
	   2000-PROCESO.
	       DISPLAY SPACES ERASE.
	       DISPLAY "ID CLIENTE:" LINE 10 POSITION 05.
		   ACCEPT ID-CLIENTE LINE 10 POSITION 33.
		   DISPLAY "NOMBRE DEL CLIENTE:" LINE 11 POSITION 05.
		   ACCEPT NOM-CLI LINE 11 POSITION 33.
		   DISPLAY "CLAVE DE LA TARJETA:" LINE 12 POSITION 05.

		   
		   CALL "LINK-CAT" USING REG-CLI.
		   
		   
		   DISPLAY "FECHA DE INGRESO:(AAAAMMDD)" LINE 15 POSITION 05.
		   ACCEPT FEC-ING LINE 15 POSITION 33.
		   
		   WRITE REG-CLI.
		   
		   DISPLAY 
			"DESEA CAPTURAR MAS REGISTROS?:(S/N)" LINE 17 POSITION 05.
		   ACCEPT WKS-DESC LINE 17 POSITION 43.
		   IF WKS-DESC = "N"
		       MOVE 1 TO WKS-FIN.
			   
			   
	   3000-FIN.
      *    CERRAR ARCHIVO.
	       CLOSE CLIENTE2.