       IDENTIFICATION DIVISION.       PROGRAM-ID. TBUS-SER.       ENVIRONMENT DIVISION.              DATA DIVISION.       WORKING-STORAGE SECTION.              		   	   01 WKS-T-A.           03 FILLER    PIC X(12) VALUE "DEBITO 87654".           03 FILLER    PIC X(12) VALUE "NOMINA 56543".           03 FILLER    PIC X(12) VALUE "CREDITO23456".                  01 T-ANUAL REDEFINES WKS-T-A.           03 T-TAR-ANU OCCURS 3 TIMES INDEXED BY WKS-I.               05 T-TAR PIC X(7).               05 T-ANU PIC 9(05).                                            01 WKS-TIPO-TAR-U  PIC X(7).              PROCEDURE DIVISION.       INICIO.	       DISPLAY SPACES ERASE.           DISPLAY "TIPO DE TARJETA: " LINE 10 POSITION 05.           ACCEPT WKS-TIPO-TAR-U LINE 10 POSITION 35.           DISPLAY "ANUALIDAD: " LINE 11 POSITION 05.		              		   SET WKS-I TO 1           SEARCH T-TAR-ANU VARYING WKS-I           AT END DISPLAY "NO EXISTE" LINE 12 POSITION 05           WHEN T-TAR (WKS-I) = WKS-TIPO-TAR-U           DISPLAY T-ANU (WKS-I) LINE 11 POSITION 35.           STOP RUN.